# Лабораторная работа №4
_Анализ и визуализация данных в Python_

Для начала о том, как пользоваться интерактивным блокнотом. Код помещается в ячейки, для выполнения кода в ячейке нужно кликнуть в ней мышкой, чтобы она выделилась, и нажать Shift-Enter. Поэкспериментируйте на ячейке ниже:

In [2]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import accuracy_score
from sklearn.model_selection import KFold
from sklearn.model_selection import GridSearchCV
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import roc_auc_score

In [3]:
data = pd.read_csv('programming-technologies-4-main/datasets/titanic.csv')

In [4]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Определить долю выживших и определите 2 наиболее важных признака для выживания при помощи DecisionTreeСlassifier на основе данных из datasets/titanic.csv.

In [5]:
survived = data[data.Survived==1]

In [6]:
survived

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

### Решающие деревья
Рассмотрим знакомый уже нам набор данных о пассажирах титаника. Определить долю выживших и определите 2 наиболее важных признака для выживания при помощи DecisionTreeСlassifier на основе данных из datasets/titanic.csv.

In [7]:
f'Доля выживших на титанике {round(len(survived) / len(data), 2)}'

'Доля выживших на титанике 0.38'

In [110]:
clf = DecisionTreeClassifier()

In [111]:
interesting = data.loc[:, ['Sex', 'Age', 'Survived', 'Pclass', 'Fare', 'SibSp']]

In [112]:
interesting.dropna(inplace=True)

In [113]:
X = interesting.iloc[:, :-1]
y = interesting.iloc[:, -1]

In [114]:
X.Sex = X.Sex.map(lambda x: 0 if x == 'female' else 1)

In [115]:
clf.fit(X, y).feature_importances_

array([0.02658303, 0.29377702, 0.03446334, 0.06948513, 0.57569147])

Вывод: Наиболее двумя значимыми признаками являются стоимость тарифа и от количества своих сопровождающих.

### Метод k ближайших соседей
Для задачи о классификации вина методом ближайших соседей произведите масштабирование признаков с помощью функции sklearn.preprocessing.scale. Снова найдите оптимальное k на кросс-валидации.

In [132]:
data = pd.read_csv('programming-technologies-4-main/datasets/wine.csv', header=None)

In [133]:
X = interesting_.iloc[:, 1:]
y = interesting_.iloc[:, 0]

In [134]:
cv = KFold(y.size, n_splits=5, shuffle=True)

In [135]:
from sklearn.preprocessing import scale
grid = {'n_neighbors': np.arange(50) + 1}
clf = KNeighborsClassifier()
gs = GridSearchCV(clf, grid, scoring='accuracy', cv=cv)

scaled_features = scale(X)

gs.fit(scaled_features, y)

GridSearchCV(cv=KFold(n_splits=714, random_state=None, shuffle=True),
             estimator=KNeighborsClassifier(),
             param_grid={'n_neighbors': array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50])},
             scoring='accuracy')

In [136]:
gs.best_params_

{'n_neighbors': 13}

In [137]:
gs.best_score_

0.7969187675070029

Вывод: В результате масштабирования признаков с помощью функции scale, мы смогли увеличить точность расчёта (по сравнению с исходным вариантом) с 77% до 80%.

### Линейная регрессия
Определить качество линейной регрессии в примере с зарплатами при помощи метрики r2_score.х

In [138]:
data = pd.read_csv('programming-technologies-4-main/datasets/salary-train.csv')
data

,FullDescription,LocationNormalized,ContractTime,SalaryNormalized
0,International Sales Manager London ****k ****...,London,permanent,33000
1,An ideal opportunity for an individual that ha...,London,permanent,50000
2,Online Content and Brand Manager// Luxury Reta...,South East London,permanent,40000
3,A great local marketleader is seeking a perman...,Dereham,permanent,22500
4,Registered Nurse / RGN Nursing Home for Young...,Sutton Coldfield,NaN,20355
...,...,...,...,...
59995,"As a result of continued growth, First Class S...",Whitley Bay,contract,26400
59996,PHP / MVC Web Developer MacclesfieldCirca ***...,Macclesfield,permanent,26000
59997,"Staff Nurse, Nursing Home, Baldock White Recru...",Baldock,NaN,24500
59998,This is one of the best agency side opportunit...,The City,permanent,65000
59999,Must have CSCS card must have asbestos awarene...,London,NaN,23040

In [139]:
data.FullDescription = data.FullDescription.str.lower()
data.FullDescription = data.FullDescription.replace('[^a-zA-Z0-9]', ' ', regex = True)

In [140]:
data['LocationNormalized'].fillna('nan', inplace=True)
data['ContractTime'].fillna('nan', inplace=True)

In [141]:
from sklearn.feature_extraction.text import TfidfVectorizer
tfid = TfidfVectorizer(min_df=5)
X_train_tfid = tfid.fit_transform(data.FullDescription)

In [142]:
from sklearn.feature_extraction import DictVectorizer
enc = DictVectorizer()
X_train_categ = enc.fit_transform(data[['LocationNormalized', 'ContractTime']].to_dict('records'))

In [143]:
from scipy.sparse import hstack
X = hstack((X_train_categ, X_train_tfid))

In [144]:
from sklearn.linear_model import Ridge
reg = Ridge(alpha=1)
reg.fit(X, data.SalaryNormalized)

predicted = reg.predict(X)

In [74]:
test = pd.read_csv('programming-technologies-4-main/datasets/salary-test-mini.csv')
test.FullDescription = test.FullDescription.str.lower()
test.FullDescription = test.FullDescription.replace('[^a-zA-Z0-9]', ' ', regex = True)
test

,FullDescription,LocationNormalized,ContractTime,SalaryNormalized
0,we currently have a vacancy for an hr project ...,Milton Keynes,contract,NaN
1,a web developer opportunity has arisen with an...,Manchester,permanent,NaN

In [145]:
from sklearn.metrics import r2_score

result = r2_score(predicted, data.SalaryNormalized)

print("Точность модели составила = " + str(result))

Точность модели составила = 0.5779415453603526

### Индивидуальное задание студента

Определите самое распространённое женское имя среди пассажиров Титаника. Извлеките из полного имени пассажира (колонка Name) его личное имя. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [83]:
data = pd.read_csv('programming-technologies-4-main/datasets/titanic.csv')

In [87]:
NameExtract=data.Name.str.extract('^.+?Mrs\..+?\((.+?)\)|^.+?Miss\.\s([\w\s]+)',expand=False)
NameExtract.fillna('',inplace=True)
NameExtract.columns = ['Mrs','Miss']

In [88]:
NameExtract['CombinedName']=NameExtract.apply(lambda x:'%s%s' % (x['Mrs'],x['Miss']),axis=1)
NameExtract.drop(['Mrs','Miss'],axis=1,inplace=True)

In [96]:
femalenames=[]
for i in range(1, NameExtract.CombinedName.count()):
    names=NameExtract.loc[i,'CombinedName']
    words=names.split(' ')
    for word in words:
        if len(word)>2 and word.find('"'):
            femalenames.append(word)

In [98]:
femalenamesDataFrame=pd.DataFrame(data=femalenames,columns=['Names'])
femalenamesDataFrame['count']= 1
femalenamesDataFrameGroupBy=femalenamesDataFrame.groupby('Names').sum()
femalenamesDataFrameSorted=femalenamesDataFrameGroupBy.sort_values(['count'], ascending=[False])
print(femalenamesDataFrameSorted.head(2))

       count
Names
Mary      18
Anna      17

Для данных europe.csv постройте модель зависимости качества жизни (Life.expect) от остальных факторов, исключая название страны. Используя метрику r2_score, оцените качество построенной модели.

In [146]:
from sklearn.metrics import r2_score
from sklearn.linear_model import Ridge

data = pd.read_csv('programming-technologies-4-main/datasets/europe.csv')

interesting = data.loc[:, ['Area', 'GDP', 'Inflation', 'Military', 'Pop.growth', 'Unemployment', 'Life.expect']]
interesting.dropna(inplace=True)

X = interesting.iloc[:, :-1]
y = interesting.iloc[:, -1]

reg = Ridge(alpha=1)

reg.fit(X, y)

prediction = reg.predict(X)

result = r2_score(y, prediction)

print("Качество построенной модели составило " + str(result))

Качество построенной модели составило 0.7667792011804502